jp.go.nict.langrid.client.ws_1_2/src/testwithserver/java/jp/go/nict/langrid/client/ws_1_2/test/axisclient/MultihopTranslationWithTemporalDictionaryService.request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:multihopTranslate
      soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:ns1="http://proxy.sun.com">
      <sourceLang xsi:type="soapenc:string"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
        >ja</sourceLang>
      <intermediateLangs
        soapenc:arrayType="soapenc:string[1]"
        xsi:type="soapenc:Array"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <intermediateLangs
          xsi:type="soapenc:string"
          >en</intermediateLangs>
      </intermediateLangs>
      <targetLang
        xsi:type="soapenc:string"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
        >fr</targetLang>
      <source
        xsi:type="soapenc:string"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
        >&#x3053;&#x3093;&#x306B;&#x3061;&#x306F;&#x4E16;&#x754C;</source>
      <temporalDict
        soapenc:arrayType="ns2:Translation[1]"
        xsi:type="soapenc:Array"
        xmlns:ns2="http://langrid.nict.go.jp/ws_1_2/bilingualdictionary/"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <temporalDict href="#id0"/>
      </temporalDict>
      <dictTargetLang
        xsi:type="soapenc:string"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">fr</dictTargetLang>
      <intermediateDictTargets
        soapenc:arrayType="xsd:string[][1]"
        xsi:type="soapenc:Array"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <intermediateDictTargets
          soapenc:arrayType="xsd:string[1]"
          xsi:type="soapenc:Array">
          <intermediateDictTargets
            xsi:type="xsd:string"
            >globbe</intermediateDictTargets>
        </intermediateDictTargets>
      </intermediateDictTargets>
      <intermediateDictTargetLangs
        soapenc:arrayType="soapenc:string[1]"
        xsi:type="soapenc:Array"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <intermediateDictTargetLangs xsi:type="soapenc:string">en</intermediateDictTargetLangs>
      </intermediateDictTargetLangs>
    </ns1:multihopTranslate>
    <multiRef
      id="id0"
      soapenc:root="0"
      soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
      xsi:type="ns3:Translation"
      xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:ns3="http://langrid.nict.go.jp/ws_1_2/bilingualdictionary/">
      <headWord xsi:type="xsd:string">&#x4E16;&#x754C;</headWord>
      <targetWords
        soapenc:arrayType="xsd:string[1]"
        xsi:type="soapenc:Array">
        <targetWords xsi:type="xsd:string">globe</targetWords>
      </targetWords>
    </multiRef>
  </soapenv:Body>
</soapenv:Envelope>